rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "app_threadx.h"
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include "debug_console.h"
#include "debug_led.h"
#include "i2c_scanner.h"
#include "ina219_power.h"
#include "inference_metrics.h"
#include "stm32n6xx_hal_cortex.h"
#include "threadx_utils.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define APP_LED_ONLY_SMOKE_TEST 0

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

__IO uint32_t BspButtonState = BUTTON_RELEASED;

DCMIPP_HandleTypeDef hdcmipp;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

UART_HandleTypeDef hlpuart1;

SPI_HandleTypeDef hspi5;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void MX_GPIO_Init(void);
static void MX_LPUART1_UART_Init(void);
static void MX_SPI5_Init(void);
static void MX_DCMIPP_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
static void SystemIsolation_Config(void);
/* USER CODE BEGIN PFP */
static void App_SystemClock_Config(void);
static void App_CameraKernelClock_Config(void);
static void Setup_Mpu(void);
extern uint32_t __snoncacheable;
extern uint32_t __enoncacheable;

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

int __io_putchar(int ch) {
	HAL_UART_Transmit(&hlpuart1, (uint8_t*) &ch, 1, 10);
	return ch;
}

/**
 * @brief Log the MCU reset source flags before clearing them.
 *
 * This helps distinguish a hard fault, watchdog reset, brown-out, or pin reset
 * when the board appears to reboot during scalar preprocessing.
 */
static void App_LogResetCause(void) {
	char line[192] = { 0 };
	const unsigned int pin =
			(__HAL_RCC_GET_FLAG(RCC_FLAG_PINRST) != RESET) ? 1U : 0U;
	const unsigned int por =
			(__HAL_RCC_GET_FLAG(RCC_FLAG_PORRST) != RESET) ? 1U : 0U;
	const unsigned int bor =
			(__HAL_RCC_GET_FLAG(RCC_FLAG_BORRST) != RESET) ? 1U : 0U;
	const unsigned int sft =
			(__HAL_RCC_GET_FLAG(RCC_FLAG_SFTRST) != RESET) ? 1U : 0U;
	const unsigned int iwdg =
			(__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST) != RESET) ? 1U : 0U;
	const unsigned int wwdg =
			(__HAL_RCC_GET_FLAG(RCC_FLAG_WWDGRST) != RESET) ? 1U : 0U;
	const unsigned int lck =
			(__HAL_RCC_GET_FLAG(RCC_FLAG_LCKRST) != RESET) ? 1U : 0U;

	(void) snprintf(line, sizeof(line),
			"[BOOT] Reset cause flags: PIN=%u POR=%u BOR=%u SFT=%u IWDG=%u WWDG=%u LCK=%u\r\n",
			pin, por, bor, sft, iwdg, wwdg, lck);
	DebugConsole_WriteString(line);
	__HAL_RCC_CLEAR_RESET_FLAGS();
}

/**
 * @brief Configure the application clock tree for camera capture.
 *
 * The generated application project did not include a SystemClock_Config()
 * routine, so the secure app inherited a 64 MHz fallback clock tree.
 * The camera path needs the same PLL1/PLL4 setup used by the working FSBL
 * reference clock tree.
 */
static void App_SystemClock_Config(void) {
	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = { 0 };
	RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
	RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

	if (HAL_PWREx_ConfigSupply(PWR_EXTERNAL_SOURCE_SUPPLY) != HAL_OK) {
		Error_Handler();
	}

	if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1)
			!= HAL_OK) {
		Error_Handler();
	}

	/* Keep HSI available while the PLL-backed system clock is reconfigured. */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV1;
	RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_NONE;
	RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_NONE;
	RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_NONE;
	RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_NONE;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		Error_Handler();
	}

	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_TIM;
	PeriphClkInitStruct.TIMPresSelection = RCC_TIMPRES_DIV1;
	if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK) {
		Error_Handler();
	}

	HAL_RCC_GetClockConfig(&RCC_ClkInitStruct);
	if ((RCC_ClkInitStruct.CPUCLKSource == RCC_CPUCLKSOURCE_IC1)
			|| (RCC_ClkInitStruct.SYSCLKSource == RCC_SYSCLKSOURCE_IC2_IC6_IC11)) {
		RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_CPUCLK
				| RCC_CLOCKTYPE_SYSCLK;
		RCC_ClkInitStruct.CPUCLKSource = RCC_CPUCLKSOURCE_HSI;
		RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
		if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct) != HAL_OK) {
			Error_Handler();
		}
	}

	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_NONE;
	RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL1.PLLSource = RCC_PLLSOURCE_HSI;
	RCC_OscInitStruct.PLL1.PLLM = 4;
	RCC_OscInitStruct.PLL1.PLLN = 75;
	RCC_OscInitStruct.PLL1.PLLFractional = 0;
	RCC_OscInitStruct.PLL1.PLLP1 = 1;
	RCC_OscInitStruct.PLL1.PLLP2 = 1;
	RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_NONE;
	RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_NONE;
	RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL4.PLLSource = RCC_PLLSOURCE_HSI;
	RCC_OscInitStruct.PLL4.PLLM = 1;
	RCC_OscInitStruct.PLL4.PLLN = 25;
	RCC_OscInitStruct.PLL4.PLLFractional = 0;
	RCC_OscInitStruct.PLL4.PLLP1 = 1;
	RCC_OscInitStruct.PLL4.PLLP2 = 1;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		Error_Handler();
	}

	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_CPUCLK | RCC_CLOCKTYPE_HCLK |
	RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 |
	RCC_CLOCKTYPE_PCLK2 | RCC_CLOCKTYPE_PCLK5 |
	RCC_CLOCKTYPE_PCLK4;
	RCC_ClkInitStruct.CPUCLKSource = RCC_CPUCLKSOURCE_IC1;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_IC2_IC6_IC11;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV4;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV1;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV1;
	RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV1;
	RCC_ClkInitStruct.APB5CLKDivider = RCC_APB5_DIV1;
	RCC_ClkInitStruct.IC1Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
	RCC_ClkInitStruct.IC1Selection.ClockDivider = 2;
	RCC_ClkInitStruct.IC2Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
	RCC_ClkInitStruct.IC2Selection.ClockDivider = 3;
	RCC_ClkInitStruct.IC6Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
	RCC_ClkInitStruct.IC6Selection.ClockDivider = 4;
	RCC_ClkInitStruct.IC11Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
	RCC_ClkInitStruct.IC11Selection.ClockDivider = 3;
	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct) != HAL_OK) {
		Error_Handler();
	}
}

/**
 * @brief Re-apply the camera kernel clocks after CubeMX peripheral init.
 *
 * CubeMX regenerates the DCMIPP MSP clock config with defaults that do not
 * match the working IMX335 capture path. Keeping the final override here in
 * application code makes it much less likely to be lost on regeneration.
 */
static void App_CameraKernelClock_Config(void) {
	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = { 0 };

	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_DCMIPP
			| RCC_PERIPHCLK_CSI;
	PeriphClkInitStruct.DcmippClockSelection = RCC_DCMIPPCLKSOURCE_IC17;
	PeriphClkInitStruct.ICSelection[RCC_IC17].ClockSelection =
			RCC_ICCLKSOURCE_PLL1;
	PeriphClkInitStruct.ICSelection[RCC_IC17].ClockDivider = 4;
	PeriphClkInitStruct.ICSelection[RCC_IC18].ClockSelection =
			RCC_ICCLKSOURCE_PLL1;
	/* 1.2 GHz / 50 = 24 MHz, which matches the IMX335 input clock setting. */
	PeriphClkInitStruct.ICSelection[RCC_IC18].ClockDivider = 50;

